package com.korgutlova.diplom.model.enums.roles;

public enum TeamRole {
    ANALYST("Aналитик", "<ul><li>управлять дополнительными сведениями по задачам;</li>" +
            "<li>может уточнить или дополнить задачу, если что-то становится непонятным студенту;</li>" +
            "<li>может задавать вопросы перед созданием новой задачи/требований, для дальнейшей консультации с разработчиком. </li></ul>"),

    PROJECT_MANAGER("Проектный менеджер", "<ul><li> распределять задачи, если этого не сделал другой бот;</li>" +
            "<li>отслеживать корректность статусов по задачам; </li>" +
            "<li>проверять заполненность таблиц списывания времени по задачам за неделю (если это подключено в конфигурации проекта);</li>" +
            "<li>отвечать на вопросы по текущим и будущим задачам. </li></ul>"),

    TEAMLEAD("Тимлидер", "<ul><li>следить за корректным созданием веток, коммитов, Pull Requests (далее PR); </li>" +
            "<li>отклонять или принимать PR;</li>" +
            "<li>отвечать на технические вопросы: по задаче, произвольному вопросу из области изучаемого языка или технологии</li></ul>"),

    TESTER("Тестировщик", "<ul><li>выдавать задачи на проверку багов (от обучающегося требуется запустить проект и проверить описанный сценарий);</li>" +
            "<li>иногда может выдавать задачи с фальшивыми ошибками, то есть они будут не воспроизводиться.</li></ul>");

    private final String name;

    private final String description;

    TeamRole(String name, String description) {
        this.name = name;
        this.description = description;
    }

    public String getName() {
        return name;
    }

    public String getDescription() {
        return description;
    }
}
